ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/МВ_ДополнительныеНастройки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВ_ДополнительныеНастройки</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.МВ_ПереченьДополнительныхНастроек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации_ХамелеонЦРПТ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ХамелионЦРПТ/src/InformationRegisters/МВ_ДополнительныеНастройки/Forms/ФормаЗаписи/Module.bsl
// ФТО:ALNA 22.07.2019 30701

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НастроитьОформлениеНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаПриИзменении(Элемент)
	
	НастроитьОформлениеНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура НастроитьОформлениеНаСервере()
	
	НастройкаОбщая = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Настройка, "Общая");
	НужнаОрганизация = (НастройкаОбщая = Ложь); //может быть NULL
	Элементы.Организация.АвтоОтметкаНезаполненного = НужнаОрганизация;
	Если НЕ НужнаОрганизация И Элементы.Организация.ОтметкаНезаполненного Тогда
		Элементы.Организация.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
	//++ ФТО:SOAL 03.10.2019 32239
	Элементы.Значение.РежимПароля = РегистрыСведений.МВ_ДополнительныеНастройки.ВключатьРежимПароляДляНастройки(Запись.Настройка); 
	//-- ФТО:SOAL 03.10.2019 
	
КонецПроцедуры

#КонецОбласти
